УТ_для_edt/src/InformationRegisters/CRM_ТекущиеЭтапыБизнесПроцессов/CRM_ТекущиеЭтапыБизнесПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ТекущиеЭтапыБизнесПроцессов</name>
  <attributes>
    <name>ТекущийЭтап</name>
    <comment>Описание текущего этапа</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>BusinessProcessRef.CRM_БизнесПроцесс</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/CRM_ТекущиеЭтапыБизнесПроцессов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция - Текущий этап бизнес процесса
//
// Параметры:
//  БизнесПроцесс	 - Ссылка, БизнесПроцессСсылка.CRM_БизнесПроцесс - Ссылка на бизнес процесс,
//  																	для которого необходимо получить текущий этап 
// 
// Возвращаемое значение:
//  Этап - Строка - Описание текущего этапа.
//
Функция ТекущийЭтапБизнесПроцесса(БизнесПроцесс) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	CRM_ТекущиеЭтапыБизнесПроцессов.ТекущийЭтап КАК ТекущийЭтап
	|ИЗ
	|	РегистрСведений.CRM_ТекущиеЭтапыБизнесПроцессов КАК CRM_ТекущиеЭтапыБизнесПроцессов
	|ГДЕ
	|	CRM_ТекущиеЭтапыБизнесПроцессов.Объект = &БизнесПроцесс");
	Запрос.УстановитьПараметр("БизнесПроцесс", БизнесПроцесс);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ТекущийЭтап;
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции

#КонецОбласти

#КонецЕсли
